// MIT License

// Copyright (c) 2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

//@skip-check server-execution-safe-mode
//@skip-check module-structure-var-in-region

#Если Не Клиент Тогда

Перем ОбъектКомпоненты;

#Область ПрограммныйИнтерфейс

// Инициализировать
// Инициализирует виртуальную машину Lua указанной версии
// 
// Параметры:
//  Версия - Строка - Версия: Lua54, LuaJIT
Процедура Инициализировать(Знач Версия = "Lua54") Экспорт
	ПриСозданииОбъекта(Версия);
КонецПроцедуры

// Выполнить код из строки
// Выполняет Lua код, переданный в виде строки
//
// Параметры:
//  Код - Строка - Программный код для выполнения
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьКодИзСтроки(Знач Код) Экспорт

	Результат = ОбъектКомпоненты.ExecuteString(Код);

	Данные = РезультатИзJSON(Результат);

	Возврат Данные["data"];

КонецФункции

// Выполнить код из файла
// Выполняет Lua код из указанного текстового файла
//
// Параметры:
//  Путь - Строка - Путь к файлу кода
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьКодИзФайла(Знач Путь) Экспорт

	Результат = ОбъектКомпоненты.ExecuteFile(Путь);

	Данные = РезультатИзJSON(Результат);

	Возврат Данные["data"];

КонецФункции

// Скомпилировать код из строки
// Преобразует исходный код в байт-код Lua
//
// Параметры:
//  Код - Строка - Программный код для компиляции
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция СкомпилироватьКодИзСтроки(Знач Код) Экспорт

	Результат = ОбъектКомпоненты.CompileToBytecode(Код);

	Если ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
		Возврат Результат;
	Иначе
		Данные = РезультатИзJSON(Результат);
		Возврат Данные;
	КонецЕсли;

КонецФункции

// Выполнить байт код
// Выполняет ранее скомпилированный код
//
// Параметры:
//  БайтКод - ДвоичныеДанные - Байт код для выполнения
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьБайтКод(Знач БайтКод) Экспорт

	Результат = ОбъектКомпоненты.ExecuteBytecode(БайтКод);

	Данные = РезультатИзJSON(Результат);

	Возврат Данные["data"];

КонецФункции

// Выполнить байт код файла
// Выполняет байт код из указанного файла
//
// Параметры:
//  Путь - Строка - Путь к файлу с байт кодом
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьБайтКодФайла(Знач Путь) Экспорт

	Результат = ОбъектКомпоненты.ExecuteBytecodeFile(Путь);

	Данные = РезультатИзJSON(Результат);

	Возврат Данные["data"];

КонецФункции

// Вызвать функцию
// Вызывает функцию, инициализированную ранее выполненным кодом
//
// Параметры:
//  ИмяФункции - Строка                 - Имя функции для вызова
//  Аргументы  - Массив Из Произвольный - Аргументы функции
Процедура ВызватьФункцию(Знач ИмяФункции, Знач Аргументы) Экспорт

	АргументыСтрокой = JSONСтрокой(Аргументы);
	Результат = ОбъектКомпоненты.CallFunction(ИмяФункции, АргументыСтрокой);

	РезультатИзJSON(Результат);

КонецПроцедуры

// Установить глобальную переменную
// Устанавливает значение глобальной переменной в контексте
//
// Параметры:
//  Имя      - Строка       - Имя переменной
//  Значение - Произвольный - Значение переменной
Процедура УстановитьГлобальнуюПеременную(Знач Имя, Знач Значение) Экспорт

	Данные        = Новый Структура("data", Значение);
	ДанныеСтрокой = JSONСтрокой(Данные);

	Результат = ОбъектКомпоненты.SetGlobal(Имя, ДанныеСтрокой);

	РезультатИзJSON(Результат);

КонецПроцедуры

// Получить глобальную переменную
// Получает значение глобальной переменной контекста
//
// Параметры:
//  Имя - Строка - Имя переменной
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ПолучитьГлобальнуюПеременную(Знач Имя) Экспорт

	Результат = ОбъектКомпоненты.GetGlobal(Имя);

	Данные = РезультатИзJSON(Результат);

	Возврат Данные["data"];

КонецФункции

// Добавить пакет из строки
// Добавляет код из строки как пакет с указанным именем
//
// Параметры:
//  ИмяПакета - Строка - Имя пакета, по которому он будет доступен после добавления
//  Код       - Строка - Программный код пакета
Процедура ДобавитьПакетИзСтроки(Знач ИмяПакета, Знач Код) Экспорт

	Результат = ОбъектКомпоненты.AddPackage(ИмяПакета, Код);
	РезультатИзJSON(Результат);

КонецПроцедуры

// Добавить пакет из файла
// Добавляет код из файла как пакет с указанным именем
//
// Параметры:
//  ИмяПакета - Строка - Имя пакета, по которому он будет доступен после добавления
//  Путь      - Строка - Путь к файлу кода
Процедура ДобавитьПакетИзФайла(Знач ИмяПакета, Знач Путь) Экспорт

	Результат = ОбъектКомпоненты.LoadPackageFromFile(ИмяПакета, Путь);
	РезультатИзJSON(Результат);

КонецПроцедуры

// Получить список пакетов
// Получает список добавленных в окружение пакетов
//
// Возвращаемое значение:
//  Массив Из Строка - Результат выполнения
Функция ПолучитьСписокПакетов() Экспорт

	Результат = ОбъектКомпоненты.GetPackages();
	Данные    = РезультатИзJSON(Результат);
	Возврат Данные["data"];

КонецФункции

// Перезапустить
// Очищает контекст выполнения и перезапускает LuaVM
Процедура Перезапустить() Экспорт

	Результат = ОбъектКомпоненты.Reset();
	РезультатИзJSON(Результат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииОбъекта(Знач Версия = "Lua54")

	СозданиеКомпоненты = ПолучитьОбъектКомпоненты(Версия);

	Если СозданиеКомпоненты["result"] Тогда
		ОбъектКомпоненты = СозданиеКомпоненты["object"];
	Иначе
		ВызватьИсключение "Невозможно создать Lua VM: " + Символы.ПС + СозданиеКомпоненты["error"];
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьОбъектКомпоненты(Знач Версия) Экспорт

	ПолноеИмя = СтрШаблон("AddIn.%1.Main", Версия);
	
	Попытка
		ОбъектКомпоненты = Новый(ПолноеИмя);
	Исключение
		
		Попытка
			
			Ошибка = ПодключитьКомпоненту(Версия);
			
			Если ЗначениеЗаполнено(Ошибка) Тогда
				ВызватьИсключение Ошибка;
			КонецЕсли;
			
			ОбъектКомпоненты = Новый(ПолноеИмя);
			
		Исключение
			Возврат Новый Структура("result,error", Ложь, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат Новый Структура("result,object", Истина, ОбъектКомпоненты);
	
КонецФункции

Функция ПодключитьКомпоненту(Знач Версия)
	
	Попытка
		
		Если ЭтоOneScript() Тогда
			
			ТекущийПуть = "";

			Выполнить("ТекущийПуть = ТекущийСценарий().Каталог");
			
			ТекущийПуть = СтрЗаменить(ТекущийПуть, "\", "/");		
			ТекущийПуть = СтрРазделить(ТекущийПуть, "/");
	
			ТекущийПуть.Удалить(ТекущийПуть.ВГраница());
			ТекущийПуть.Удалить(ТекущийПуть.ВГраница());
	
			ТекущийПуть.Добавить("addins");
			ТекущийПуть.Добавить(СтрШаблон("%1.zip", Версия));
			
			ПолныйПуть = СтрСоединить(ТекущийПуть, "/");
			
		Иначе
			
			//@skip-check module-unused-local-variable
			МакетКомпоненты = ПолучитьМакет(Версия);
			ПолныйПуть      = "";
			
			Выполнить("ПолныйПуть = ПоместитьВоВременноеХранилище(МакетКомпоненты)");
			
		КонецЕсли;

		Возврат ?(ПодключитьВнешнююКомпоненту(ПолныйПуть, Версия, ТипВнешнейКомпоненты.Native)
			, Неопределено
			, "Не удалось подключить внешнюю компоненту");

	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

Функция РезультатИзJSON(Знач СтрокаJSON)

	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();

	Если Не Результат["result"] Тогда
		ВызватьИсключение Результат["error"];
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция JSONСтрокой(Знач Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Функция ЭтоOneScript()

    Попытка

        Ответ = Ложь;

        // BSLLS:UnusedLocalVariable-off

        //@skip-check module-unused-local-variable
        Проверка = Новый ЗащищенноеСоединениеOpenSSL;

        // BSLLS:UnusedLocalVariable-on

    Исключение
        Ответ = Истина;
    КонецПопытки;

    Возврат Ответ;
    	
КонецФункции

#КонецОбласти

#КонецЕсли
