#Использовать asserts
#Использовать "../src/os"

Процедура Бенчмарк1()

	МассивЗначений = Новый Массив;
	ГСЧ            = Новый ГенераторСлучайныхЧисел();

	Для Н = 1 По 1000000 Цикл
		МассивЗначений.Добавить(ГСЧ.СлучайноеЧисло(0, 1000));
	КонецЦикла;

	ДатаНачалаOS    = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РезультатOS     = OS_Бенчмарк1(МассивЗначений);
	ДатаОкончанияOS = ТекущаяУниверсальнаяДатаВМиллисекундах();


	ДатаНачалаLua    = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РезультатLua     = Lua_Бенчмарк1(МассивЗначений);
	ДатаОкончанияLua = ТекущаяУниверсальнаяДатаВМиллисекундах();


	Код = "
	|function countValuesGreaterThan(array, threshold)
	|	local count = 0
	|	
	|	for _, value in ipairs(array) do
	|		if value > threshold then
	|			count = count + 1
	|		end
	|	end
	|	
	|	return count
	|end";

	Lua = Новый Lua();
	БайтКод = Lua.СкомпилироватьКодИзСтроки(Код);

	ДатаНачалаLuac    = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РезультатLuac     = Luac_Бенчмарк1(МассивЗначений, БайтКод);
	ДатаОкончанияLuac = ТекущаяУниверсальнаяДатаВМиллисекундах();


	Ожидаем.Что(РезультатOS).Равно(РезультатLua);
	Ожидаем.Что(РезультатOS).Равно(РезультатLuac);

	ВремяOS   = ДатаОкончанияOS - ДатаНачалаOS;
	ВремяLua  = ДатаОкончанияLua - ДатаНачалаLua;
	ВремяLuac = ДатаОкончанияLuac - ДатаНачалаLuac;

	Сообщить(СтрШаблон("
	| OS: %1
	| LUA: %2
	| LUA(c): %3", ВремяOS, ВремяLua, ВремяLuac));

КонецПроцедуры

Функция OS_Бенчмарк1(МассивЗначений)

	Счетчик = 0;

	Для Каждого Значение Из МассивЗначений Цикл
		Если Значение > 500 Тогда
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;

	Возврат Счетчик;

КонецФункции

Функция Lua_Бенчмарк1(МассивЗначений)

	Код = "
	|function countValuesGreaterThan(array, threshold)
	|	local count = 0
	|	
	|	for _, value in ipairs(array) do
	|		if value > threshold then
	|			count = count + 1
	|		end
	|	end
	|	
	|	return count
	|end";

	Lua = Новый Lua();
	Lua.ВыполнитьКодИзСтроки(Код);

	МассивАргументов = Новый Массив;
	МассивАргументов.Добавить(МассивЗначений);
	МассивАргументов.Добавить(500);

	Результат = Lua.ВызватьФункцию("countValuesGreaterThan", МассивАргументов);
	
	Возврат Результат;

КонецФункции

Функция Luac_Бенчмарк1(МассивЗначений, БайтКод)

	Lua = Новый Lua();
	Lua.ВыполнитьБайтКод(БайтКод);

	МассивАргументов = Новый Массив;
	МассивАргументов.Добавить(МассивЗначений);
	МассивАргументов.Добавить(500);

	Результат = Lua.ВызватьФункцию("countValuesGreaterThan", МассивАргументов);
	
	Возврат Результат;

КонецФункции

Бенчмарк1();