
#Использовать asserts
#Использовать "../src/os"

Перем ПутьКФайлу;

#Область Тесты

&ТестовыйНабор
Процедура ПриСозданииОбъекта()

КонецПроцедуры

&Порядок(1)
&Тест
Процедура СозданиеОбъекта() Экспорт

	Lua = Новый Lua();

КонецПроцедуры

&Порядок(2)
&Тест
Процедура ВыполнитьКодИзСтроки() Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua();
	Результат = Lua.ВыполнитьКодИзСтроки(Код);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(3)
&Тест
Процедура СкомпилироватьКодИзСтроки() Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua();
	Результат = Lua.СкомпилироватьКодИзСтроки(Код);

	Ожидаем.Что(Результат).ИмеетТип("ДвоичныеДанные");

	ПутьКФайлу = ПолучитьИмяВременногоФайла("luac");
	Результат.Записать(ПутьКФайлу);

КонецПроцедуры

&Порядок(3)
&Тест
Процедура ВыполнитьБайтКод() Экспорт

	БайтКод = Новый ДвоичныеДанные(ПутьКФайлу);

	Lua = Новый Lua();
	Результат = Lua.ВыполнитьБайтКод(БайтКод);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

#КонецОбласти

//СозданиеОбъекта();
//ВыполнитьКодИзСтроки();
СкомпилироватьКодИзСтроки();
ВыполнитьБайтКод();