
#Использовать asserts
#Использовать "../src/os"

Перем ПутьКФайлу;

#Область Тесты

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
	ПутьКФайлу = "";
КонецПроцедуры

&Порядок(1)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура СозданиеОбъекта(Версия) Экспорт

	Lua = Новый Lua(Версия);

КонецПроцедуры

&Порядок(2)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура ВыполнитьКодИзСтроки(Версия) Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua(Версия);
	Результат = Lua.ВыполнитьКодИзСтроки(Код);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(3)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура ВыполнитьКодИзФайла(Версия) Экспорт

	ТекущийПуть = СтрЗаменить(ТекущийСценарий().Каталог, "\", "/");
	ТекущийПуть = СтрРазделить(ТекущийПуть, "/");

	ТекущийПуть.Добавить("code.lua");

	Путь = СтрСоединить(ТекущийПуть, "/");

	Lua = Новый Lua(Версия);
	Результат = Lua.ВыполнитьКодИзФайла(Путь);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(4)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура СкомпилироватьКодИзСтроки(Версия) Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua(Версия);
	Результат = Lua.СкомпилироватьКодИзСтроки(Код);

	Ожидаем.Что(Результат).ИмеетТип("ДвоичныеДанные");

КонецПроцедуры

&Порядок(5)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура ВыполнитьБайтКод(Версия) Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua(Версия);
	БайтКод = Lua.СкомпилироватьКодИзСтроки(Код);

	Ожидаем.Что(БайтКод).ИмеетТип("ДвоичныеДанные");

	Lua = Новый Lua(Версия);
	Результат = Lua.ВыполнитьБайтКод(БайтКод);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(6)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура ВыполнитьБайтКодФайла(Версия) Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua(Версия);
	Результат = Lua.СкомпилироватьКодИзСтроки(Код);

	Ожидаем.Что(Результат).ИмеетТип("ДвоичныеДанные");

	ПутьКФайлу = ПолучитьИмяВременногоФайла("luac");
	Результат.Записать(ПутьКФайлу);

	Lua = Новый Lua(Версия);
	Результат = Lua.ВыполнитьБайтКодФайла(ПутьКФайлу);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(7)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура УстановитьПолучитьГлобальнуюПеременную(Версия) Экспорт

	Lua = Новый Lua(Версия);
	Lua.УстановитьГлобальнуюПеременную("newvar", Новый Структура("hey", "yo"));

	Результат = Lua.ПолучитьГлобальнуюПеременную("newvar");

	Ожидаем.Что(Результат["hey"]).Равно("yo");

КонецПроцедуры

&Порядок(8)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура ДобавитьПолучитьПакетИзСтроки(Версия) Экспорт

	КодПакета = "
	|return {
    |	sum = function(a, b) return a + b end
	|}";

	КодМодуля = "
	|local m = require(""math"")
	|return m.sum(5, 3)";

	Lua = Новый Lua(Версия);
	Lua.ДобавитьПакетИзСтроки("math", КодПакета);

	Результат = Lua.ВыполнитьКодИзСтроки(КодМодуля);

	Ожидаем.Что(Результат).Равно(8);

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(1);
	Ожидаем.Что(Результат[0]).Равно("math");

	Lua.Перезапустить();

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(0);

КонецПроцедуры

&Порядок(9)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура ДобавитьПолучитьПакетИзФайла(Версия) Экспорт

	ТекущийПуть = СтрЗаменить(ТекущийСценарий().Каталог, "\", "/");
	ТекущийПуть = СтрРазделить(ТекущийПуть, "/");

	ТекущийПуть.Добавить("package.lua");

	Путь = СтрСоединить(ТекущийПуть, "/");
	
	КодМодуля = "
	|local m = require(""math"")
	|return m.sum(5, 3)";

	Lua = Новый Lua(Версия);
	Lua.ДобавитьПакетИзФайла("math", Путь);

	Результат = Lua.ВыполнитьКодИзСтроки(КодМодуля);

	Ожидаем.Что(Результат).Равно(8);

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(1);
	Ожидаем.Что(Результат[0]).Равно("math");

	Lua.Перезапустить();

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(0);

КонецПроцедуры

&Порядок(10)
&ПараметризованныйТест
&ИсточникЗначение("Lua54")
&ИсточникЗначение("LuaJIT")
Процедура ВызватьФункцию(Версия) Экспорт

	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(100);
	МассивЗначений.Добавить(200);
	МассивЗначений.Добавить(300);
	МассивЗначений.Добавить(400);
	МассивЗначений.Добавить(500);
	МассивЗначений.Добавить(600);

	Код = "
	|function countValuesGreaterThan(array, threshold)
	|	local count = 0
	|	
	|	for _, value in ipairs(array) do
	|		if value > threshold then
	|			count = count + 1
	|		end
	|	end
	|	
	|	return count
	|end";

	Lua = Новый Lua(Версия);
	Lua.ВыполнитьКодИзСтроки(Код);

	МассивАргументов = Новый Массив;
	МассивАргументов.Добавить(МассивЗначений);
	МассивАргументов.Добавить(200);

	Результат = Lua.ВызватьФункцию("countValuesGreaterThan", МассивАргументов);
	
	Ожидаем.Что(Результат).Равно(4);

КонецПроцедуры

#КонецОбласти

//СозданиеОбъекта();
//ВыполнитьКодИзСтроки();
//СкомпилироватьКодИзСтроки();
//ВыполнитьБайтКод();
//ВыполнитьКодИзФайла();
//УстановитьПолучитьГлобальнуюПеременную();
//ДобавитьПолучитьПакетИзСтроки();
//ДобавитьПолучитьПакетИзФайла();