
#Использовать asserts
#Использовать "../src/os"

Перем ПутьКФайлу;

#Область Тесты

&ТестовыйНабор
Процедура ПриСозданииОбъекта()

КонецПроцедуры

&Порядок(1)
&Тест
Процедура СозданиеОбъекта() Экспорт

	Lua = Новый Lua();

КонецПроцедуры

&Порядок(2)
&Тест
Процедура ВыполнитьКодИзСтроки() Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua();
	Результат = Lua.ВыполнитьКодИзСтроки(Код);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(3)
&Тест
Процедура ВыполнитьКодИзФайла() Экспорт

	ТекущийПуть = СтрЗаменить(ТекущийСценарий().Каталог, "\", "/");
	ТекущийПуть = СтрРазделить(ТекущийПуть, "/");

	ТекущийПуть.Добавить("code.lua");

	Путь = СтрСоединить(ТекущийПуть, "/");

	Lua = Новый Lua();
	Результат = Lua.ВыполнитьКодИзФайла(Путь);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(4)
&Тест
Процедура СкомпилироватьКодИзСтроки() Экспорт

	Код = "local x = 10 + 5
	|return x";

	Lua = Новый Lua();
	Результат = Lua.СкомпилироватьКодИзСтроки(Код);

	Ожидаем.Что(Результат).ИмеетТип("ДвоичныеДанные");

	ПутьКФайлу = ПолучитьИмяВременногоФайла("luac");
	Результат.Записать(ПутьКФайлу);

КонецПроцедуры

&Порядок(5)
&Тест
Процедура ВыполнитьБайтКод() Экспорт

	БайтКод = Новый ДвоичныеДанные(ПутьКФайлу);

	Lua = Новый Lua();
	Результат = Lua.ВыполнитьБайтКод(БайтКод);

	Ожидаем.Что(Результат).Равно(15);

КонецПроцедуры

&Порядок(6)
&Тест
Процедура УстановитьПолучитьГлобальнуюПеременную() Экспорт

	Lua = Новый Lua();
	Lua.УстановитьГлобальнуюПеременную("newvar", Новый Структура("hey", "yo"));

	Результат = Lua.ПолучитьГлобальнуюПеременную("newvar");

	Ожидаем.Что(Результат["hey"]).Равно("yo");

КонецПроцедуры

&Порядок(7)
&Тест
Процедура ДобавитьПолучитьПакетИзСтроки() Экспорт

	КодПакета = "
	|return {
    |	sum = function(a, b) return a + b end
	|}";

	КодМодуля = "
	|local m = require(""math"")
	|return m.sum(5, 3)";

	Lua = Новый Lua();
	Lua.ДобавитьПакетИзСтроки("math", КодПакета);

	Результат = Lua.ВыполнитьКодИзСтроки(КодМодуля);

	Ожидаем.Что(Результат).Равно(8);

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(1);
	Ожидаем.Что(Результат[0]).Равно("math");

	Lua.Перезапустить();

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(0);

КонецПроцедуры

&Порядок(8)
&Тест
Процедура ДобавитьПолучитьПакетИзФайла() Экспорт

	ТекущийПуть = СтрЗаменить(ТекущийСценарий().Каталог, "\", "/");
	ТекущийПуть = СтрРазделить(ТекущийПуть, "/");

	ТекущийПуть.Добавить("package.lua");

	Путь = СтрСоединить(ТекущийПуть, "/");
	
	КодМодуля = "
	|local m = require(""math"")
	|return m.sum(5, 3)";

	Lua = Новый Lua();
	Lua.ДобавитьПакетИзФайла("math", Путь);

	Результат = Lua.ВыполнитьКодИзСтроки(КодМодуля);

	Ожидаем.Что(Результат).Равно(8);

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(1);
	Ожидаем.Что(Результат[0]).Равно("math");

	Lua.Перезапустить();

	Результат = Lua.ПолучитьСписокПакетов();
	Ожидаем.Что(Результат.Количество()).Равно(0);

КонецПроцедуры

#КонецОбласти

//СозданиеОбъекта();
//ВыполнитьКодИзСтроки();
//СкомпилироватьКодИзСтроки();
//ВыполнитьБайтКод();
//ВыполнитьКодИзФайла();
//УстановитьПолучитьГлобальнуюПеременную();
//ДобавитьПолучитьПакетИзСтроки();
//ДобавитьПолучитьПакетИзФайла();